## Production: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                            NAME                             |
|--------|-------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.gc_design_system_error`   |
|        | `aws_cloudwatch_log_metric_filter.gc_design_system_warning` |
|        | `aws_cloudwatch_metric_alarm.gc_design_system_error`        |
|        | `aws_cloudwatch_metric_alarm.gc_design_system_warning`      |
|        | `aws_sns_topic.cloudwatch_warning`                          |
|        | `aws_sns_topic_subscription.alert_warning`                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.gc_design_system_error will be created
  + resource "aws_cloudwatch_log_metric_filter" "gc_design_system_error" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/gc-design-system-api"
      + name           = "GCDesignSystemErrorLogged"
      + pattern        = "?ERROR ?Error"

      + metric_transformation {
          + name      = "GCDesignSystemErrorLogged"
          + namespace = "GCDesignSystem"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.gc_design_system_warning will be created
  + resource "aws_cloudwatch_log_metric_filter" "gc_design_system_warning" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/gc-design-system-api"
      + name           = "GCDesignSystemWarningLogged"
      + pattern        = "WARNING"

      + metric_transformation {
          + name      = "GCDesignSystemWarningLogged"
          + namespace = "GCDesignSystem"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.gc_design_system_error will be created
  + resource "aws_cloudwatch_metric_alarm" "gc_design_system_error" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Errors logged by the GC Design System"
      + alarm_name                            = "GC Design System Errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "GCDesignSystemErrorLogged"
      + namespace                             = "GCDesignSystem"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.gc_design_system_warning will be created
  + resource "aws_cloudwatch_metric_alarm" "gc_design_system_warning" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Warnings logged by the GC Design System"
      + alarm_name                            = "GC Design System Warnings"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "GCDesignSystemWarningLogged"
      + namespace                             = "GCDesignSystem"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # aws_sns_topic.cloudwatch_warning will be created
  + resource "aws_sns_topic" "cloudwatch_warning" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "gc-design-system-cloudwatch-alarms-warning"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "gc-design-system-production"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.alert_warning will be created
  + resource "aws_sns_topic_subscription" "alert_warning" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.gc_design_system_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.gc_design_system_warning"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.gc_design_system_error"]

21 tests, 18 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
